'''
Create By Joompot Sriyapan
Date 5/4/2019

Name 
    Example 1.1.3
Description 
    คำนวณคณิตศาสตร์
Note
    เราสามารถเขียนโปรแกรมคำนวณค่าทางคณิตศาสตร์ได้ 
    + แทนการบวก
    - แทนการลบ
    * แทนการคูณ
    / ใช้แทนการหาร
    % ใช้ในการหารเอาเศษ เช่น 8%3 จะได้เศษ 2
    // หารเอาจำนวนเต็ม เช่น 10//3 จะได้ 3
    ** แทนเครื่องหมายยกกำลัง เช่น 2**3 ได้ 8
    e แทนการคูณด้วย 10 ยกกำลัง n เช่น 2e3 =  2*(10**3) จะได้เท่ากับ 2000
Display
    7
    4
    20
    2.0
    1.5
    2.3333333333333335
    0
    2
    3
    8
    2000.0
    2000
    4
    24
    7
Required
    python 3.7.3
Pre-programmed
    -
'''

#Example 1.1.3
#Python 3.7.3

print (3+4)         #3+4
print (6-2)         #6-2
print (4*5)         #4x5
print (4/2)         #4 หาร 2
print (3/2)         #3 หาร 2
print (7/3)         #7 หาร 3
print (4%2)         #4 modulus 2 (หารเอาเศษ)
print (8%3)         #8 modulus 3 
print (10//3)        #10 floor division 3 (หารเอาจำนวนเต็ม)
print (2**3)        #2 power 3 (ยกกำลัง)
print (2e3)         #2x10 power 3 (2 คูณ 10 ยกกำลัง 3)
print (2*(10**3))   #2*10 power 3
print (10-2*3)      #10 - (2x3)
print ((10-2)*3)    #(10-2) x 3
print (3*2+1)       #(3x2) +1
