#Python 3.7.3
#Example 2-9-2

def hello():
    
    word = {
        "1":"สวัสดีวันอาทิตย์",
        "2":"สวัสดีวันจันทร์์",
        "3":"สวัสดีวันอังคาร",
        "4":"สวัสดีวันพุธ",
        "5":"สวัสดีวันพฤหัสบดี",
        "6":"สวัสดีวันศุกร์",
        "7":"สวัสดีวันเสาร์",
        "0":"ลาก่อน"  
    }
    loop = True
    while loop:
        x = input("ป้อนเลข 1-7 (ป้อน 0 เพื่อออกจากโปรแกรม) :")
        if x == "0":
            print (word["0"])
            loop = False
        elif x in word:
            print (word[x])

if __name__=='__main__':
    hello()