'''
Create By Joompot Sriyapan
Date 20/4/2019

Name 
    Example 1.5.9
Description 
    list
Note
    x[Start: End before: Skip]
Display

Required
    python 3.7.3
Pre-programmed
    -
'''

#Example 1.5.9
#Python 3.7.3

def example_509():
    i = [11,12,13,14,15,16,17,18,19,20]
    
    print ("1) i=",i)
    print ("2) i[2:5]=",i[2:5]) 
    print ("3) i[2:9:2]=",i[2:9:2])
    #[Start: End before: Skip]#
    print ("4) i[:5]=",i[:5])
    print ("5) i[::2]=",i[::2])
    print ("6) i[::-1]=",i[::-1])
    print ("7) i[::-2]=",i[::-2])
    print ("8) i[-8:-1]=",i[-8:-1])
    print ("9) i[-8:-1:2]=",i[-8:-1:2])
    print ("10) i[-8:-1:-2]=",i[-8:-1:-2])
    print ("11) i[-1:-8]=",i[-1:-8])

example_509()

'''
print ("1) i=",i)
แสดงค่าใน i = [11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

print ("2) i[2:5]=",i[2:5])
แสดงค่าใน i ตั้งแต่ตัวที่ 2 ถึง น้อยกว่าตัวที่ 5 (เริ่มที่ 0)  = [13, 14, 15]

print ("3) i[2:9:2]=",i[2:9:2])
แสดงค่าใน i ตั้งแต่ตัวที่ 2 ถึง 9 ข้ามทีละ 2 ตัว  =[13, 15, 17, 19]

print ("4) i[:5]=",i[:5])
แสดงค่าใน i ตั้งแต่ตัวแรก ถึง น้อยกว่าตัวที่ 5 = [11, 12, 13, 14, 15]

print ("5) i[::2]=",i[::2])
แสดงค่าใน i ตั้งแต่ตัวแรก อ่านข้ามทีละ 2 ตัว = [11, 13, 15, 17, 19]

print ("6) i[::-1]=",i[::-1])
แสดงค่าใน i นับจากตัวสุดท้าย = [20, 19, 18, 17, 16, 15, 14, 13, 12, 11]

print ("7) i[::-2]=",i[::-2])
แสดงค่าใน i นับจากตัวสุดท้าย อ่านข้ามทีละ 2 ตัว = [20, 18, 16, 14, 12]

print ("8) i[-8:-1]=",i[-8:-1])
แสดงค่าใน i ตั้งแต่ตัวที่ 8 จากท้าย ถึงก่อนตัวที่ 1 จากท้าย = [13, 14, 15, 16, 17, 18, 19]

print ("9) i[-8:-1:2]=",i[-8:-1:2])
แสดงค่าใน i ตั้งแต่ตัวที่ 8 จากท้าย ถึงก่อนตัวที่ 1 จากท้าย ข้ามทีละสองตัว = [13, 15, 17, 19]

print ("10) i[-8:-1:-2]=",i[-8:-1:-2])
อ่านผิดลำดับ ได้ list ว่าง [] 

print ("11) i[-1:-8]=",i[-1:-8])
อ่านผิดลำดับ ได้ list ว่าง []

แสดงผล
1) i= [11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
2) i[2:5]= [13, 14, 15]
3) i[2:9:2]= [13, 15, 17, 19]
4) i[:5]= [11, 12, 13, 14, 15]
5) i[::2]= [11, 13, 15, 17, 19]
6) i[::-1]= [20, 19, 18, 17, 16, 15, 14, 13, 12, 11]
7) i[::-2]= [20, 18, 16, 14, 12]
8) i[-8:-1]= [13, 14, 15, 16, 17, 18, 19]
9) i[-8:-1:2]= [13, 15, 17, 19]
10) i[-8:-1:-2]= []
11) i[-1:-8]= []
'''
